<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="x.1" type="Parameter" version="opset1">
			<data shape="1,3,626,256" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx::Conv_1074" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="0" size="3456" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1074">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/conv_stem/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Reshape_337768" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3456" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/conv_stem/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_stem/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_337781" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3584" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/blocks/blocks.0/blocks.0.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_337833" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4736" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/blocks/blocks.0/blocks.0.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.0/blocks.0.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/blocks/blocks.0/blocks.0.0/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.0/blocks.0.0/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_337839" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="4864" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/blocks/blocks.0/blocks.0.0/se/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.0/blocks.0.0/se/ReduceMean_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="blocks.0.0.se.conv_reduce.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 32, 1, 1" offset="4880" size="1024" />
			<output>
				<port id="0" precision="FP32" names="blocks.0.0.se.conv_reduce.weight">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/blocks/blocks.0/blocks.0.0/se/conv_reduce/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Reshape_337852" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="5904" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/blocks/blocks.0/blocks.0.0/se/conv_reduce/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.0/blocks.0.0/se/conv_reduce/Conv_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/blocks/blocks.0/blocks.0.0/se/act1/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.0/blocks.0.0/se/act1/Mul_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="blocks.0.0.se.conv_expand.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 8, 1, 1" offset="5936" size="1024" />
			<output>
				<port id="0" precision="FP32" names="blocks.0.0.se.conv_expand.weight">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/blocks/blocks.0/blocks.0.0/se/conv_expand/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_337869" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="6960" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/blocks/blocks.0/blocks.0.0/se/conv_expand/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.0/blocks.0.0/se/conv_expand/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/blocks/blocks.0/blocks.0.0/se/gate/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.0/blocks.0.0/se/gate/Sigmoid_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/blocks/blocks.0/blocks.0.0/se/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.0/blocks.0.0/se/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="onnx::Conv_1080" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="7088" size="2048" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1080">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/blocks/blocks.0/blocks.0.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_337886" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="9136" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/blocks/blocks.0/blocks.0.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.0/blocks.0.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="onnx::Conv_1083" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="9200" size="6144" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1083">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/blocks/blocks.1/blocks.1.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_337901" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="15344" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/blocks/blocks.1/blocks.1.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/blocks/blocks.1/blocks.1.0/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/blocks/blocks.1/blocks.1.0/conv_dw/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Shape_1_output_0,/blocks/blocks.1/blocks.1.0/conv_dw/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="15728" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="35" name="Constant_337913" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="15736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="36" name="/blocks/blocks.1/blocks.1.0/conv_dw/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="37" name="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_2_output_0,/blocks/blocks.1/blocks.1.0/conv_dw/Cast_3_output_0" />
			</output>
		</layer>
		<layer id="38" name="Constant_353968" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15744" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="39" name="/blocks/blocks.1/blocks.1.0/conv_dw/Div_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Div_1_output_0" />
			</output>
		</layer>
		<layer id="40" name="/blocks/blocks.1/blocks.1.0/conv_dw/Ceil_1" type="Ceiling" version="opset1">
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Ceil_1_output_0" />
			</output>
		</layer>
		<layer id="41" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_10" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15748" size="4" />
			<output>
				<port id="0" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_10_output_0" />
			</output>
		</layer>
		<layer id="42" name="Multiply_354062" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="43" name="Constant_354070" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15752" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="44" name="/blocks/blocks.1/blocks.1.0/conv_dw/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Add_3_output_0" />
			</output>
		</layer>
		<layer id="45" name="/blocks/blocks.1/blocks.1.0/conv_dw/Sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="46" name="/blocks/blocks.1/blocks.1.0/conv_dw/Clip_1" type="Clamp" version="opset1">
			<data min="0" max="3.4028234663852886e+38" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Clip_1_output_0" />
			</output>
		</layer>
		<layer id="47" name="Constant_353976" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15744" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="48" name="/blocks/blocks.1/blocks.1.0/conv_dw/Div_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Div_2_output_0" />
			</output>
		</layer>
		<layer id="49" name="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_4" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_4_output_0" />
			</output>
		</layer>
		<layer id="50" name="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_5" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_5_output_0" />
			</output>
		</layer>
		<layer id="51" name="Constant_337972" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="15736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/blocks/blocks.1/blocks.1.0/conv_dw/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/blocks/blocks.1/blocks.1.0/conv_dw/Sub_4" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Sub_4_output_0" />
			</output>
		</layer>
		<layer id="54" name="Constant_337974" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="15736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/blocks/blocks.1/blocks.1.0/conv_dw/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="15756" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_output_0" />
			</output>
		</layer>
		<layer id="57" name="Constant_337909" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="15736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="58" name="/blocks/blocks.1/blocks.1.0/conv_dw/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Gather_output_0" />
			</output>
		</layer>
		<layer id="59" name="/blocks/blocks.1/blocks.1.0/conv_dw/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_1_output_0,/blocks/blocks.1/blocks.1.0/conv_dw/Cast_output_0" />
			</output>
		</layer>
		<layer id="60" name="Constant_353980" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15744" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="61" name="/blocks/blocks.1/blocks.1.0/conv_dw/Div" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Div_output_0" />
			</output>
		</layer>
		<layer id="62" name="/blocks/blocks.1/blocks.1.0/conv_dw/Ceil" type="Ceiling" version="opset1">
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Ceil_output_0" />
			</output>
		</layer>
		<layer id="63" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_4" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15748" size="4" />
			<output>
				<port id="0" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="64" name="Multiply_354072" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="65" name="Constant_354080" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15752" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="66" name="/blocks/blocks.1/blocks.1.0/conv_dw/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Add_1_output_0" />
			</output>
		</layer>
		<layer id="67" name="/blocks/blocks.1/blocks.1.0/conv_dw/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="68" name="/blocks/blocks.1/blocks.1.0/conv_dw/Clip" type="Clamp" version="opset1">
			<data min="0" max="3.4028234663852886e+38" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Clip_output_0" />
			</output>
		</layer>
		<layer id="69" name="Constant_353988" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15744" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="70" name="/blocks/blocks.1/blocks.1.0/conv_dw/Div_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Div_3_output_0" />
			</output>
		</layer>
		<layer id="71" name="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_6" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_6_output_0" />
			</output>
		</layer>
		<layer id="72" name="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_7" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_7_output_0" />
			</output>
		</layer>
		<layer id="73" name="Constant_337976" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="15736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/blocks/blocks.1/blocks.1.0/conv_dw/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/blocks/blocks.1/blocks.1.0/conv_dw/Sub_5" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Sub_5_output_0" />
			</output>
		</layer>
		<layer id="76" name="Constant_337978" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="15736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/blocks/blocks.1/blocks.1.0/conv_dw/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/blocks/blocks.1/blocks.1.0/conv_dw/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_8" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_8_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/blocks/blocks.1/blocks.1.0/conv_dw/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="15764" size="32" />
			<output>
				<port id="0" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/ConstantOfShape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/blocks/blocks.1/blocks.1.0/conv_dw/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Concat_2_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="15796" size="16" />
			<output>
				<port id="0" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_18_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/blocks/blocks.1/blocks.1.0/conv_dw/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Reshape_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_20" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="15812" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_20_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_21" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="15820" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_21_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_22" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="15812" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_22_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/blocks/blocks.1/blocks.1.0/conv_dw/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Slice_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_338003" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="15828" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/blocks/blocks.1/blocks.1.0/conv_dw/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Transpose_output_0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_343442" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="15812" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/blocks/blocks.1/blocks.1.0/conv_dw/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/blocks/blocks.1/blocks.1.0/conv_dw/Cast_9_output_0,/blocks/blocks.1/blocks.1.0/conv_dw/Reshape_1_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_338011" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="15736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="93" name="Split_338012" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_24" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="15844" size="4" />
			<output>
				<port id="0" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Constant_24_output_0" />
			</output>
		</layer>
		<layer id="95" name="/blocks/blocks.1/blocks.1.0/conv_dw/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>313</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Pad_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>315</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_338257" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="15848" size="3456" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/blocks/blocks.1/blocks.1.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>315</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Reshape_338309" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="19304" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/blocks/blocks.1/blocks.1.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/blocks/blocks.1/blocks.1.0/bn2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/bn2/act/Mul_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_338315" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="4864" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/blocks/blocks.1/blocks.1.0/se/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/se/ReduceMean_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="blocks.1.0.se.conv_reduce.weight" type="Const" version="opset1">
			<data element_type="f32" shape="4, 96, 1, 1" offset="19688" size="1536" />
			<output>
				<port id="0" precision="FP32" names="blocks.1.0.se.conv_reduce.weight">
					<dim>4</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/blocks/blocks.1/blocks.1.0/se/conv_reduce/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_338328" type="Const" version="opset1">
			<data element_type="f32" shape="1, 4, 1, 1" offset="21224" size="16" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/blocks/blocks.1/blocks.1.0/se/conv_reduce/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/se/conv_reduce/Conv_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/blocks/blocks.1/blocks.1.0/se/act1/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/se/act1/Mul_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="blocks.1.0.se.conv_expand.weight" type="Const" version="opset1">
			<data element_type="f32" shape="96, 4, 1, 1" offset="21240" size="1536" />
			<output>
				<port id="0" precision="FP32" names="blocks.1.0.se.conv_expand.weight">
					<dim>96</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/blocks/blocks.1/blocks.1.0/se/conv_expand/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Reshape_338345" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="22776" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/blocks/blocks.1/blocks.1.0/se/conv_expand/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/se/conv_expand/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/blocks/blocks.1/blocks.1.0/se/gate/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.0/se/gate/Sigmoid_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/blocks/blocks.1/blocks.1.0/se/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/se/Mul_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="onnx::Conv_1089" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="23160" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1089">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/blocks/blocks.1/blocks.1.0/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Reshape_338362" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="32376" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/blocks/blocks.1/blocks.1.0/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.0/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="onnx::Conv_1092" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="32472" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1092">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/blocks/blocks.1/blocks.1.1/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Reshape_338377" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="46296" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/blocks/blocks.1/blocks.1.1/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks/blocks.1/blocks.1.1/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/blocks/blocks.1/blocks.1.1/bn1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks/blocks.1/blocks.1.1/bn1/act/Mul_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>157</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Reshape_338390" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="46872" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/blocks/blocks.1/blocks.1.1/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
